# **Data Science Learners Hub**

**Module : SQL**

**Topic :** <span style="font-weight: 600; font-family: -apple-system, BlinkMacSystemFont, sans-serif; color: var(--vscode-foreground);">Misc Concepts</span>

**email** : [luckyrathod.forum@gmail.com](mailto:luckyrathod.forum@gmail.com)

In [3]:
CREATE TABLE EMPLOYEE
       (EMPNO NUMERIC(4) NOT NULL,
        ENAME VARCHAR(10),
        JOB VARCHAR(9),
        MGR NUMERIC(4),
        HIREDATE DATE,
        SAL NUMERIC(7, 2),
        COMM NUMERIC(7, 2),
        DEPTNO NUMERIC(2));

In [8]:
INSERT INTO EMPLOYEE VALUES
        (7369, 'SMITH',  'CLERK',     7902,
        '17-DEC-1980',  800, NULL, 20);
INSERT INTO EMPLOYEE VALUES
        (7499, 'ALLEN',  'SALESMAN',  7698,
        '20-FEB-1981', 1600,  300, 30);
INSERT INTO EMPLOYEE VALUES
        (7521, 'WARD',   'SALESMAN',  7698,
        '22-FEB-1981', 1250,  500, 30);
INSERT INTO EMPLOYEE VALUES
        (7566, 'JONES',  'MANAGER',   7839,
        '2-APR-1981',  2975, NULL, 20);
INSERT INTO EMPLOYEE VALUES
        (7654, 'MARTIN', 'SALESMAN',  7698,
        '28-SEP-1981', 1250, 1400, 30);
INSERT INTO EMPLOYEE VALUES
        (7698, 'BLAKE',  'MANAGER',   7839,
        '1-MAY-1981',  2850, NULL, 30);
INSERT INTO EMPLOYEE VALUES
        (7782, 'CLARK',  'MANAGER',   7839,
        '9-JUN-1981',  2450, NULL, 10);
INSERT INTO EMPLOYEE VALUES
        (7788, 'SCOTT',  'ANALYST',   7566,
        '09-DEC-1982', 3000, NULL, 20);
INSERT INTO EMPLOYEE VALUES
        (7839, 'KING',   'PRESIDENT', NULL,
        '17-NOV-1981', 5000, NULL, 10);
INSERT INTO EMPLOYEE VALUES
        (7844, 'TURNER', 'SALESMAN',  7698,
        '8-SEP-1981',  1500,    0, 30);
INSERT INTO EMPLOYEE VALUES
        (7876, 'ADAMS',  'CLERK',     7788,
        '12-JAN-1983', 1100, NULL, 20);
INSERT INTO EMPLOYEE VALUES
        (7900, 'JAMES',  'CLERK',     7698,
        '3-DEC-1981',   950, NULL, 30);
INSERT INTO EMPLOYEE VALUES
        (7902, 'FORD',   'ANALYST',   7566,
        '3-DEC-1981',  3000, NULL, 20);
INSERT INTO EMPLOYEE VALUES
        (7934, 'MILLER', 'CLERK',     7782,
        '23-JAN-1982', 1300, NULL, 10);

In [10]:
SELECT * from EMPLOYEE WHERE hiredate >= '01-jan-1981' and hiredate <= '31-dec-1981'
-- The above condition is like between condition
--Doubt
--Sir, should the date format be always in this format '31-dec-1981' 
-- DD-MMM-YYYY, YYYY-MM-DD, DD-MM-YYYY
-- Most of the commonly used format it recognises

EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
7499,ALLEN,SALESMAN,7698,1981-02-20,1600.00,300.00,30
7521,WARD,SALESMAN,7698,1981-02-22,1250.00,500.00,30
7566,JONES,MANAGER,7839,1981-04-02,2975.00,NULL,20
7654,MARTIN,SALESMAN,7698,1981-09-28,1250.00,1400.00,30
7698,BLAKE,MANAGER,7839,1981-05-01,2850.00,NULL,30
7782,CLARK,MANAGER,7839,1981-06-09,2450.00,NULL,10
7839,KING,PRESIDENT,NULL,1981-11-17,5000.00,NULL,10
7844,TURNER,SALESMAN,7698,1981-09-08,1500.00,0.00,30
7900,JAMES,CLERK,7698,1981-12-03,950.00,NULL,30
7902,FORD,ANALYST,7566,1981-12-03,3000.00,NULL,20

**HOW TO MAKE THE ABOVE QUERY COMPACT USING <mark>ALIAS</mark>**

- By using Alias u can make compact
- if the table name is very lengthly it becomes difficult to JOIN multiple tables
- The column name can be prefixed with Alias name
- The alias name holds good for current query only
- The scope of alias is limited to the same query in which it is used
- Note : Once u define an alias for the table, therafter u can access the columns of table only using alias name

### **How to get Grand Total  using ROLLUP() ?**

- A ROLLUP is an extended version of GROUP BY
- Rollup is used with GROUP BY for adding the rows retrieved by Group BY  

  <span style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; color: var(--vscode-foreground);"><b>Syntax</b></span>

  

SELECT \<Column Names\>

  

FROM \<Table name\>

  

GROUP BY ROLLUP(\<Column Name\>)

In [1]:
SELECT Region, SUM(SALES) AS SalesAmount, SUM(Profit) AS ProfitAmount, COUNT(*) AS TotalOrderCount
FROM SalesOrder
GROUP BY ROLLUP(Region)

Region,SalesAmount,ProfitAmount,TotalOrderCount
Central,501239.89080000046,39706.362500000105,2323
East,678781.2399999982,91522.78000000017,2848
South,391721.90500000067,46749.43030000008,1620
West,725457.8244999994,108418.4489000001,3203
NULL,2297200.860299999,286397.0217000005,9994

### **How to rename NULL to GrandTotal**

- This can be done using **COALESCE**() function : It looks for null values in region column and replace with grand total
- **Note** : If there are multiple NULL values in region column than COALESCE() function does not work

In [2]:
SELECT COALESCE(Region,'GrandTotal'), SUM(SALES) AS SalesAmount, SUM(Profit) AS ProfitAmount, COUNT(*) AS TotalOrderCount
FROM SalesOrder
GROUP BY ROLLUP(Region)

(No column name),SalesAmount,ProfitAmount,TotalOrderCount
Central,501239.89080000046,39706.362500000105,2323
East,678781.2399999982,91522.78000000017,2848
South,391721.90500000067,46749.43030000008,1620
West,725457.8244999994,108418.4489000001,3203
GrandTotal,2297200.860299999,286397.0217000005,9994

### **Note** : If your column name contains hyphen or space use \[\] to that column name

## **<mark>JOINS</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#JOINS)

**<mark>Joins is very very very important</mark>**

Used to get multiple table info in one query by join

Without having a common column we cannot join two tables

**TYPES OF JOIN**

**Important JOINs**

INNER JOIN (Also called as EQUI JOIN or JOIN)

RIGHT JOIN (Also called as RIGHT OUTER JOIN)

LEFT JOIN (Also called as LEFT OUTER JOIN)

**Less Important Join**

FULL JOIN (Also called as FULL OUTER JOIN)

CARTESIAN JOIN

Database.xls file is uploaded for tmrw practise on google drive :

In [ ]:
-- JOIN BASICALLY IS MANY TO MANY RELATION
-- Here * indicates all the columns from emp table and dept table (SELECT * FROM emp INNER JOIN Dept)
-- This tables are not actually joined in the db. The joined table is in temp memory

SELECT Top 5 * 
FROM emp 
INNER JOIN Dept 
ON emp.deptno=dept.deptno
ORDER BY emp.deptno

SELECT COUNT(*) FROM emp
SELECT COUNT(*) FROM dept

In [ ]:
-- GET all orders placed by the customer add column returned from returns table
-- RETURNS keyword use
SELECT Top 5 SalesOrder.[Customer Name],SalesOrder.Discount, SalesOrder.[Product Name], SalesOrder.[Order ID], [Returns].Returned
FROM SalesOrder
LEFT JOIN [Returns]
ON SalesOrder.[Order ID]=[Returns].[Order ID]
ORDER BY SalesOrder.[Customer Name]

In [ ]:
-- LEFT JOIN
-- Matched rows + unmatched rows from SalesOrder table

SELECT Top 5 SalesOrder.[Customer Name],SalesOrder.Discount, SalesOrder.[Product Name], SalesOrder.[Order ID], [Returns].Returned, SalesOrder.Region
FROM SalesOrder
LEFT JOIN [Returns]
ON SalesOrder.[Order ID]=[Returns].[Order ID]
ORDER BY SalesOrder.[Customer Name]

In [ ]:
-- RIGHT JOIN
-- Matched rows + unmatched rows from Returns table

SELECT Top 5 SalesOrder.[Customer Name],SalesOrder.Discount, SalesOrder.[Product Name], SalesOrder.[Order ID], [Returns].Returned, SalesOrder.Region
FROM SalesOrder
RIGHT JOIN [Returns]
ON SalesOrder.[Order ID]=[Returns].[Order ID]
ORDER BY SalesOrder.[Customer Name]

### **<mark>SELF JOIN</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#SELF-JOIN)

- The self join is used on limited scenarios only
- We use self join on a table if a particular colum has a link with another columns data values. 
- Like in case of emp table the Mgr column as Manager No. This manager no is actually the Emp No of Emp No column.
- Now to get the manager name u need to do self join
- Since we are joining u use JOIN keyword and u need two tables. So in this case we will use one table with two different aliases ex : E1 and E2.
- Both E1 and E2 are the aliases of the empno
- Definition : Self join is a type of join where the table is join to itself

### **<mark>CROSS JOIN</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#CROSS-JOIN)

- We never use it
- Every record in the first table will join with the every other record of the second table

**Syntax**

SELECT \* FROM \<Table1\>... \<Table N\>

**<mark>DELETE AND TRUNCATE STATEMENT</mark>**

- DELETE used to remove partial rows in table
- DELETE Generates a log file for each record deleted
- Delete all records but the memory spaces alloted to this records are not deleted and cant be allocated to other purposes. 
- Above problem is solved with TRUNCATE command. TRUNCATE will delete all the records and deallocates the memory alloted to these deleted records.
- WHERE clause cannot be used with TRUNCATE command
- TRUNCATE does not have a log file so we will not know what records are deleted
- TRUNCATE generates log file with a single statement saying data has been deleted from the table
- In real time when u use data backup, data migration TRUNCATE is used.
- TRUNCATE is powerful and fast

**<mark>RULES/CONSTRAINTS</mark>**

- If u dont create rules while creating table than it will except duplicate values
- Column values cannot be restricted
- Column values can consider NULL values if user missed to insert the data
- Rules have to applied while creating a table
- Rules can also be applied post creating a table

**Question** :  <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">If</span>  <span style="caret-color: rgb(0, 0, 0); color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; background-color: rgb(255, 255, 255);"><span class="Apple-converted-space">&nbsp;</span>u mention only<span class="Apple-converted-space">&nbsp;</span></span>  <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">UNIQUE</span> <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">constraint</span> <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">without</span>  <span style="caret-color: rgb(0, 0, 0); color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; background-color: rgb(255, 255, 255);"><span class="Apple-converted-space">&nbsp;</span>mentioning<span class="Apple-converted-space">&nbsp;</span></span>  <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">NOT NULL</span>  <span style="caret-color: rgb(0, 0, 0); color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; background-color: rgb(255, 255, 255);"><span class="Apple-converted-space">&nbsp;</span>will that column accept<span class="Apple-converted-space">&nbsp;</span></span>  <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">NULL</span> <span style="box-sizing: border-box; font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; color: rgb(0, 0, 255);">VALUE</span>

**Ans**  <span style="caret-color: rgb(0, 0, 0); color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; background-color: rgb(255, 255, 255);"><span class="Apple-converted-space">&nbsp;</span>: Only once, because the second NULL will become duplicate</span>

In [ ]:
CREATE TABLE Rule02
(
    empno CHAR(5) NOT NULL UNIQUE, -- Can this be considered as PRIMARY KEY ?
    ename VARCHAR(40) NOT NULL,
    DoJ DATE NOT NULL,
    Sal NUMERIC(10)
)

**<mark>PRIMARY KEY</mark>**

- NOTE : In a table only one primary key is present
- Does not accept NULL values and duplicate values
- Indirectly NOT NULL + UNIQUE is referred as PRIMARY KEY constraint
- Why do we need PRIMARY KEY

Question : Sir, what is the difference between NOT NULL + UNIQUE constraint and  PRIMARY KEY ?

Answer : Foreign Key will only refer to the Primary Key

**<mark>COMPOSITE KEY AND FOREIGN KEY</mark>**

- In SQL, a composite key, also known as a composite primary key, is a combination of two or more columns that uniquely identifies a row or record in a database table. Unlike a single-column primary key, which uses a single field to uniquely identify each record, a composite key relies on multiple columns working together to ensure uniqueness.
    
- Composite keys are useful when you need to ensure uniqueness based on a combination of columns rather than just a single column. They are often used in tables that represent relationships between two or more entities.
    
- It is just like primary key. Primary key is applied on single column whereas composite key is applied on two or more columns to identify unique rows
    
- A composite key is applied on multiple columns
    
- Multiple columns together are considered as unique

**<mark>FOREIGN KEY CONSTRAINT</mark>**

- Foreign Key can be applied on both PRIMARY KEY and UNIQUE columns

**<mark>DOUBTS</mark>**

- Sir, can FOREIGN KEY be applied on Column with UNIQUE constraint ?
    - Yes, but it might become a loop hole Since UNIQUE can accept one single NULL value
- Can FOREIGN KEY can be applied on COMPOSITE KEY
    - Yes, but should refer to multiple comloumns as defined in Composite Key Constraint
- Sir what is the difference between UNIQUE+ NOT NULL on a column and PRIMARY KEY on a column
    - Both are same

### **<mark>OPERATORS</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#OPERATORS)

- Two SELECT statement you want to append it to make a single statement
- Used to append multiple select statement with different scenarios
- Make sure that SELECT statement get same column details as well as same no of coluns also

UNION ALL : Combines both the SELECT statement including the duplicates

UNION : Combines both the SELECT statement and keeps only one copy of the duplicates 

INTERSECT : Common records present in both the select statement 

EXCEPT : Records present in first select statement

### **<mark>SUB QUERIES</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#SUB-QUERIES)

- It is used when u want to access a column within same table
- It is used when we use aggregate functions value to get a set of records

### **<mark>TEMPORARY TABLES</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#TEMPORARY-TABLES)

- These tables are created for temporary usage and the duration of this table is limited to the session or transaction
- Session gets created when u open the query window and gets closed once u close the query window
- temporary tables are created as normal tables except that the tempory table name is prefixed by '#'
- The temporary table gets stored in Database-\>Tempdb-\>Temporary Tables

**<mark>Types of Temporary Table</mark>**

- **Local temp table** : starts with #
    - Are accessible within the same session that created it
- **Global temp table** : starts with ##
    - Accessible across the LAN until every user on the lan closes the session
    - Accessible across multiple session within the same database

**<mark>Misc</mark>**

- The temp table gets remoed or dropped automatically

### **<mark>DOUBTS CLARIFICATION</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#DOUBTS-CLARIFICATION)

- Sir, can FOREIGN KEY be applied on Column with UNIQUE constraint ?
    
    - Yes, but it might become a loop hole Since UNIQUE can accept one single NULL value
- Can FOREIGN KEY can be applied on COMPOSITE KEY
    
    - Yes, but should refer to multiple Columns as defined in Composite Key Constraint
- Sir what is the difference between UNIQUE+ NOT NULL on a column and PRIMARY KEY on a column
    
    - Both are same
- Sir, can we change the DEFAULT value after creating the table
    
    - Yes
- Sir, Can FOREIGN KEY be applied on a column which is not UNIQUE, not a PRIMARY or COMPOSITE Key
    
    - Not Possible (Pls check)
- Sir, cant we ALTER multiple column in single ALTER SQL statement ?
    
    - No we cannot alter multiple columns in one go
- Sir, is it mandatory to mention the column datatype whenever we try to alter a column
    
    - Yes you have to always mention the datatype along with constraint if any
    - ex : ALTER COLUMN eid INT NOT NULL
- Sir, how to change the DEFAULT value given to a column as the following statement is giving error
    
    ```
    ALTER TABLE EmpAddressTest
    ALTER COLUMN city VARCHAR(50) DEFAULT 'Mahabubnagar'
    
    ```
    
    - Drop the default constriant on City and than try to execute the below command
    
    ```
    ALTER TABLE EmpAddressTest
    ADD CONSTRAINT DF_CITY DEFAULT 'Mahabubnagar' FOR CITY
    
    ```
    
- Sir can all the above Operators used on more than two select statement
    
    - Yes, frame the paranthesis properly and use it depending on the requirement
- The Temporary table is not shown under Database→tempdb→TemporaryTables

Note

There is a difference between '=' and 'LIKE'

We use 'LIKE' when we need to do comparison with approximate types of value

We use '=' when we require a specific value

The wild character '%' is not used with '=' operator

  

NOT EQUAL to operator '\<\>'

select \* from emp where ename='SCOTT'

### **<mark>GROUP BY</mark>**[](http://localhost:8888/notebooks/Documents/1.PROJECTS/SelfPacedSQL/SQLClass.ipynb#GROUP-BY)

- Generally used to create summary reports or high level dashboards in BI Tools like PowerBI, Informatica, Tableau, SQL
- We group rows based on some criteria like 'deptno' and grouping into one row
- **Numerical columns you can use aggregate function only**
- **Text values u can do COUNT only**
- In BI tools we dont write queries we just do drag and drop
- Never use \* with select statement if u are using GROUP BY